OpenFOAM/WFD_OpenFOAM/cases/overnight_20260527_224229_bca724/baseline_pitch_8p5_chord_0p4_0p6_0p25/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.45 -0.45 -0.60)
    ( 0.45 -0.45 -0.60)
    ( 0.45  0.45 -0.60)
    (-0.45  0.45 -0.60)
    (-0.45 -0.45  1.20)
    ( 0.45 -0.45  1.20)
    ( 0.45  0.45  1.20)
    (-0.45  0.45  1.20)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (24 24 48) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    sideWalls
    {
        type patch;
        faces
        (
            (0 1 5 4)
            (1 2 6 5)
            (2 3 7 6)
            (3 0 4 7)
        );
    }
);

// ************************************************************************* //
